# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. 🙂

In [1]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you’ll―of course―overcome them with what you learned in class! 😉

## Food Choices Data Set

### Load the Data

In [2]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = '/workspaces/ds-fall-2025-fri-1230/Week-02-Pandas-Part-2-and-DS-Overview/data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [3]:
# Count by hand. (lol kidding)
df_food.shape

(125, 61)

What are the columns and their types in this data set?

In [4]:
# Show the column names and their types.
df_food.shape
#OR
df_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   GPA                           123 non-null    object
 1   Gender                        125 non-null    int64
 2   breakfast                     125 non-null    int64
 3   calories_chicken              125 non-null    int64
 4   calories_day                  106 non-null    float64
 5   calories_scone                124 non-null    float64
 6   coffee                        125 non-null    int64
 7   comfort_food                  124 non-null    object
 8   comfort_food_reasons          123 non-null    object
 9   comfort_food_reasons_coded    106 non-null    float64
 10  cook                          122 non-null    float64
 11  comfort_food_reasons_coded.1  125 non-null    int64
 12  cuisine                       108 non-null    float64
 13  diet_current                  124 non-null    object
 14  diet_current_coded            125 non-null    int64
 15  drink                         123 non-null    float64
 16  eating_changes                122 non-null    object
 17  eating_changes_coded          125 non-null    int64
 18  eating_changes_coded1         125 non-null    int64
 19  eating_out                    125 non-null    int64
 20  employment                    116 non-null    float64
 21  ethnic_food                   125 non-null    int64
 22  exercise                      112 non-null    float64
 23  father_education              124 non-null    float64
 24  father_profession             122 non-null    object
 25  fav_cuisine                   123 non-null    object
 26  fav_cuisine_coded             125 non-null    int64
 27  fav_food                      123 non-null    float64
 28  food_childhood                124 non-null    object
 29  fries                         125 non-null    int64
 30  fruit_day                     125 non-null    int64
 31  grade_level                   125 non-null    int64
 32  greek_food                    125 non-null    int64
 33  healthy_feeling               125 non-null    int64
 34  healthy_meal                  124 non-null    object
 35  ideal_diet                    124 non-null    object
 36  ideal_diet_coded              125 non-null    int64
 37  income                        124 non-null    float64
 38  indian_food                   125 non-null    int64
 39  italian_food                  125 non-null    int64
 40  life_rewarding                124 non-null    float64
 41  marital_status                124 non-null    float64
 42  meals_dinner_friend           122 non-null    object
 43  mother_education              122 non-null    float64
 44  mother_profession             123 non-null    object
 45  nutritional_check             125 non-null    int64
 46  on_off_campus                 124 non-null    float64
 47  parents_cook                  125 non-null    int64
 48  pay_meal_out                  125 non-null    int64
 49  persian_food                  124 non-null    float64
 50  self_perception_weight        124 non-null    float64
 51  soup                          124 non-null    float64
 52  sports                        123 non-null    float64
 53  thai_food                     125 non-null    int64
 54  tortilla_calories             124 non-null    float64
 55  turkey_calories               125 non-null    int64
 56  type_sports                   99 non-null     object
 57  veggies_day                   125 non-null    int64
 58  vitamins                      125 non-null    int64
 59  waffle_calories               125 non-null    int64
 60  weight                        123 non-null    object
dtypes: float64(20), int64(27), object(14)
memory usage: 59.7+ KB

### Clean the Data

Perhaps we’d like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. …and maybe gender.

Can you remove the other columns?

In [5]:
# Remove ‘em.
selectdf = df_food[['calories_day', 'weight', 'Gender']] #double bracket for 1+ cols , returns df -- single bracket returns series 
selectdf.head()

   calories_day                    weight  Gender
0           NaN                       187       2
1           3.0                       155       1
2           4.0  I'm not answering this.        1
3           3.0             Not sure, 240       1
4           2.0                       190       1

What about `NaN`s? How many are there?

In [6]:
# Count ‘em.
selectdf.isna().sum()

calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s―the entire row.

In [7]:
# Drop ‘em.
dropdf = selectdf.dropna() #drops entire row if only 1 nan
#check
dropdf.isna().sum()

calories_day    0
weight          0
Gender          0
dtype: int64

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. 🤔

In [8]:
# Fix that.
dropdf.info() #weight col is object -- need to drop non-numerics ones + turn it numeric dt
dropdf['numeric_weight'] = pd.to_numeric(dropdf['weight'], errors='coerce') #turns every number to num dt + coerce turns everything else NaN
dropdf.isna().sum() #there's 3
dropdf = dropdf.dropna()
dropdf.isna().sum() #check - 0 nans + numeric weigh is float dt
df = dropdf[["calories_day", "numeric_weight", "Gender"]] 
df.rename(columns={'Gender':'gender'}, inplace=True ) 
df

<class 'pandas.core.frame.DataFrame'>
Index: 104 entries, 1 to 123
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   calories_day  104 non-null    float64
 1   weight        104 non-null    object
 2   Gender        104 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.2+ KB

/tmp/ipykernel_4070/1558325677.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dropdf['numeric_weight'] = pd.to_numeric(dropdf['weight'], errors='coerce') #turns every number to num dt + coerce turns everything else NaN
/tmp/ipykernel_4070/1558325677.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.rename(columns={'Gender':'gender'}, inplace=True )

     calories_day  numeric_weight  gender
1             3.0           155.0       1
4             2.0           190.0       1
5             3.0           190.0       1
6             3.0           180.0       2
7             3.0           137.0       1
..            ...             ...     ...
118           3.0           140.0       1
119           3.0           185.0       2
120           4.0           156.0       1
121           2.0           180.0       1
123           4.0           135.0       2

[101 rows x 3 columns]

Now this data seems reasonably clean for our purposes! 😁

Let’s save it somewhere to be shipped off to another teammate. 💾

In [9]:
# Savey save!
df.to_csv('../data/cleaned_food_coded.csv')

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [10]:
import os
#os.rename('../data/Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv','../data/manager_salary_survey.tsv')

In [11]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('../data/manager_salary_survey.tsv', sep= '\t')
df_salary.shape
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                                                                                                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                                                                                                --------------  -----
 0   Timestamp                                                                                                                                                                                                                             28062 non-null  object
 1   How old are you?                                                                                                                                                                                                                      28062 non-null  object
 2   What industry do you work in?                                                                                                                                                                                                         27988 non-null  object
 3   Job title                                                                                                                                                                                                                             28061 non-null  object
 4   If your job title needs additional context, please clarify here:                                                                                                                                                                      7262 non-null   object
 5   What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  28062 non-null  object
 6   How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                        20766 non-null  float64
 7   Please indicate the currency                                                                                                                                                                                                          28062 non-null  object
 8   If "Other," please indicate the currency here:                                                                                                                                                                                        206 non-null    object
 9   If your income needs additional context, please provide it here:                                                                                                                                                                      3042 non-null   object
 10  What country do you work in?                                                                                                                                                                                                          28062 non-null  object
 11  If you're in the U.S., what state do you work in?                                                                                                                                                                                     23039 non-null  object
 12  What city do you work in?                                                                                                                                                                                                             27980 non-null  object
 13  How many years of professional work experience do you have overall?                                                                                                                                                                   28062 non-null  object
 14  How many years of professional work experience do you have in your field?                                                                                                                                                             28062 non-null  object
 15  What is your highest level of education completed?                                                                                                                                                                                    27840 non-null  object
 16  What is your gender?                                                                                                                                                                                                                  27891 non-null  object
 17  What is your race? (Choose all that apply.)                                                                                                                                                                                           27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

Was that hard? 🙃

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [12]:
# Count by hand. I’m dead serious.
df_salary.shape #28,062 rows amd 18 cols

(28062, 18)

What are the columns and their types?

In [13]:
# Show the column names and their types.
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                                                                                                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                                                                                                --------------  -----
 0   Timestamp                                                                                                                                                                                                                             28062 non-null  object
 1   How old are you?                                                                                                                                                                                                                      28062 non-null  object
 2   What industry do you work in?                                                                                                                                                                                                         27988 non-null  object
 3   Job title                                                                                                                                                                                                                             28061 non-null  object
 4   If your job title needs additional context, please clarify here:                                                                                                                                                                      7262 non-null   object
 5   What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  28062 non-null  object
 6   How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                        20766 non-null  float64
 7   Please indicate the currency                                                                                                                                                                                                          28062 non-null  object
 8   If "Other," please indicate the currency here:                                                                                                                                                                                        206 non-null    object
 9   If your income needs additional context, please provide it here:                                                                                                                                                                      3042 non-null   object
 10  What country do you work in?                                                                                                                                                                                                          28062 non-null  object
 11  If you're in the U.S., what state do you work in?                                                                                                                                                                                     23039 non-null  object
 12  What city do you work in?                                                                                                                                                                                                             27980 non-null  object
 13  How many years of professional work experience do you have overall?                                                                                                                                                                   28062 non-null  object
 14  How many years of professional work experience do you have in your field?                                                                                                                                                             28062 non-null  object
 15  What is your highest level of education completed?                                                                                                                                                                                    27840 non-null  object
 16  What is your gender?                                                                                                                                                                                                                  27891 non-null  object
 17  What is your race? (Choose all that apply.)                                                                                                                                                                                           27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

Oh… Ugh! Give these columns easier names to work with first. 🙄

In [14]:
# Rename ‘em.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed, gender, race
df_salary.columns= ['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_compensation', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_education_completed', 'gender', 'race'
]
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   timestamp                    28062 non-null  object
 1   age                          28062 non-null  object
 2   industry                     27988 non-null  object
 3   title                        28061 non-null  object
 4   title_context                7262 non-null   object
 5   salary                       28062 non-null  object
 6   additional_compensation      20766 non-null  float64
 7   currency                     28062 non-null  object
 8   other_currency               206 non-null    object
 9   salary_context               3042 non-null   object
 10  country                      28062 non-null  object
 11  state                        23039 non-null  object
 12  city                         27980 non-null  object
 13  total_yoe                    28062 non-null  object
 14  field_yoe                    28062 non-null  object
 15  highest_education_completed  27840 non-null  object
 16  gender                       27891 non-null  object
 17  race                         27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

It’s a lot, and that should not have been easy. 😏

You’re going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [15]:
# List the unique industries and a count of their instances.
df_salary['industry'].value_counts()

industry
Computing or Tech                        4699
Education (Higher Education)             2464
Nonprofits                               2419
Health care                              1896
Government and Public Administration     1889
                                         ...
Warehousing                                 1
Education (Early Childhood Education)       1
SAAS                                        1
Health and Safety                           1
Aerospace Manufacturing                     1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you’re looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [16]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_tech = df_salary[df_salary['industry']== 'Computing or Tech']

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [17]:
# Sanity Check 
df_tech['industry'].unique()
#or
df_tech['industry'].value_counts()

industry
Computing or Tech    4699
Name: count, dtype: int64

We are very interested in salary figures. But how many dollars 💵 is a euro 💶 or a pound 💷? That sounds like a problem for another day. 🫠

For now, let’s just look at U.S. dollars (`'USD'`).

In [18]:
# Filtery filter for just the jobs that pay in USD!
df_tech = df_tech[df_tech['currency']== 'USD']
df_tech['currency'].value_counts()

currency
USD    3777
Name: count, dtype: int64

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [19]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
df_tech['country'].value_counts()

country
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Ghana                          1
Nigeria                        1
ss                             1
Nigeria                        1
Burma                          1
Name: count, Length: 76, dtype: int64

### Clean the Data

Well, we can’t get our answers with what we currently have, so you’ll have to make some changes.

Let’s not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value―say, `'US'`, which is nice and short.

In [20]:
# Replace them all with 'US'.

usa = df_tech['country'].value_counts().head(5).index #index obj treats it like a list
df_tech['country'] = df_tech['country'].replace(usa, 'US')

Have a look at the count of each unique country again now.

In [21]:
# Count again.
df_tech['country'].value_counts()

country
US                3408
United States       68
Usa                 59
USA                 56
usa                 28
                  ...
Ghana                1
Nigeria              1
ss                   1
Nigeria              1
Burma                1
Name: count, Length: 72, dtype: int64

Did you notice anything interesting?

In [22]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.
# normalize
df_tech['country'] = df_tech['country'].str.strip() 
df_tech['country'] = df_tech['country'].str.lower()
df_tech['country'] = df_tech['country'].str.replace(r'[.]','',regex=True) #drops all .s
# dictionary of misspelled usa
us_correct = {'us':'US', 'usa':'US', 'united states':'US', 'united states of america':'US','united state of america':'US', 
 'unitedstates':'US', 'unite states':'US', 'uniyed states':'US', 'america':'US', 'united stated':'US', 'united stateds':'US',
 'isa':'US', 'united stares':'US', "unites states":'US', "united state":'US'} #15 misspellings
df_tech['country'].unique()
df_tech['country'] = df_tech['country'].replace(us_correct) 
df_tech['country'].unique()

df_tech['country'].value_counts()

country
US                      3724
israel                     5
canada                     5
denmark                    2
australia                  2
india                      2
new zealand                2
united kingdom             2
brazil                     2
spain                      2
singapore                  2
france                     2
nigeria                    2
poland                     2
puerto rico                1
remote (philippines)       1
international              1
danmark                    1
italy                      1
pakistan                   1
mexico                     1
uruguay                    1
cuba                       1
san francisco              1
romania                    1
netherlands                1
china                      1
australian                 1
japan                      1
thailand                   1
jamaica                    1
colombia                   1
ghana                      1
ss                         1
burma                      1
Name: count, dtype: int64

In [23]:

# BONUS CREDIT: if you’ve resolved it, let’s see how well you did by counting the number of instances of each unique value.
df_tech['country'].value_counts()

country
US                      3724
israel                     5
canada                     5
denmark                    2
australia                  2
india                      2
new zealand                2
united kingdom             2
brazil                     2
spain                      2
singapore                  2
france                     2
nigeria                    2
poland                     2
puerto rico                1
remote (philippines)       1
international              1
danmark                    1
italy                      1
pakistan                   1
mexico                     1
uruguay                    1
cuba                       1
san francisco              1
romania                    1
netherlands                1
china                      1
australian                 1
japan                      1
thailand                   1
jamaica                    1
colombia                   1
ghana                      1
ss                         1
burma                      1
Name: count, dtype: int64

It’s looking good so far. Let’s find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [24]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
df_tech.info()
us_states_df = df_tech[df_tech['country'] == 'US']


us_states_df['salary'].min()
#us_states_df['salary'].mean()
us_states_df['salary'].max()
us_states_df['country'] #value_counts()
us_states_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3777 entries, 8 to 28060
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   timestamp                    3777 non-null   object
 1   age                          3777 non-null   object
 2   industry                     3777 non-null   object
 3   title                        3777 non-null   object
 4   title_context                706 non-null    object
 5   salary                       3777 non-null   object
 6   additional_compensation      2932 non-null   float64
 7   currency                     3777 non-null   object
 8   other_currency               5 non-null      object
 9   salary_context               541 non-null    object
 10  country                      3777 non-null   object
 11  state                        3704 non-null   object
 12  city                         3769 non-null   object
 13  total_yoe                    3777 non-null   object
 14  field_yoe                    3777 non-null   object
 15  highest_education_completed  3751 non-null   object
 16  gender                       3757 non-null   object
 17  race                         3751 non-null   object
dtypes: float64(1), object(17)
memory usage: 560.6+ KB
<class 'pandas.core.frame.DataFrame'>
Index: 3724 entries, 8 to 28058
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   timestamp                    3724 non-null   object
 1   age                          3724 non-null   object
 2   industry                     3724 non-null   object
 3   title                        3724 non-null   object
 4   title_context                697 non-null    object
 5   salary                       3724 non-null   object
 6   additional_compensation      2898 non-null   float64
 7   currency                     3724 non-null   object
 8   other_currency               4 non-null      object
 9   salary_context               533 non-null    object
 10  country                      3724 non-null   object
 11  state                        3702 non-null   object
 12  city                         3716 non-null   object
 13  total_yoe                    3724 non-null   object
 14  field_yoe                    3724 non-null   object
 15  highest_education_completed  3698 non-null   object
 16  gender                       3704 non-null   object
 17  race                         3699 non-null   object
dtypes: float64(1), object(17)
memory usage: 552.8+ KB

Well, pooh! We forgot that `salary` isn’t numeric. Something wrong must be fixed.

In [25]:
# Fix it.
#remove commas 1st
us_states_df['salary'].replace(r'[,]','', regex=True, inplace=True)  
us_states_df['salary'] = pd.to_numeric(us_states_df['salary'])
us_states_df['salary'].dtype
us_states_df.info()
#salary is now int

<class 'pandas.core.frame.DataFrame'>
Index: 3724 entries, 8 to 28058
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   timestamp                    3724 non-null   object
 1   age                          3724 non-null   object
 2   industry                     3724 non-null   object
 3   title                        3724 non-null   object
 4   title_context                697 non-null    object
 5   salary                       3724 non-null   int64
 6   additional_compensation      2898 non-null   float64
 7   currency                     3724 non-null   object
 8   other_currency               4 non-null      object
 9   salary_context               533 non-null    object
 10  country                      3724 non-null   object
 11  state                        3702 non-null   object
 12  city                         3716 non-null   object
 13  total_yoe                    3724 non-null   object
 14  field_yoe                    3724 non-null   object
 15  highest_education_completed  3698 non-null   object
 16  gender                       3704 non-null   object
 17  race                         3699 non-null   object
dtypes: float64(1), int64(1), object(16)
memory usage: 552.8+ KB

/tmp/ipykernel_4070/1146371375.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  us_states_df['salary'].replace(r'[,]','', regex=True, inplace=True)
/tmp/ipykernel_4070/1146371375.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  us_states_df['salary'].replace(r'[,]','', regex=True, inplace=True)
/tmp/ipykernel_4070/1146371375.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  us_states_df['salary'] = pd.to_numeric(us_states_df['salary'])

Let’s try that again.

In [26]:
# Try it again. Yeah!
#some ppl work in multiple states
print(us_states_df['state'].unique())
#min, mean,max of each state sorted by mean
agg_df = us_states_df.groupby('state')['salary'].agg(['min', 'mean', 'max']).sort_values(by='mean', ascending=False)
agg_df.head()


#us_states_df['country'] #value_counts()

['Missouri' 'Pennsylvania' 'Virginia' 'Massachusetts' 'North Carolina'
 'Michigan' 'Minnesota' 'Maryland' 'New York' 'Indiana' 'Ohio' 'Texas' nan
 'Colorado' 'California' 'Washington' 'Illinois' 'Tennessee' 'Wisconsin'
 'Louisiana' 'Florida' 'New Jersey' 'Nevada' 'Arkansas' 'Utah' 'Nebraska'
 'Georgia' 'South Carolina' 'Kentucky' 'District of Columbia' 'Oregon'
 'New Mexico' 'Connecticut' 'Iowa' 'New Hampshire' 'Idaho' 'Rhode Island'
 'Kansas' 'West Virginia' 'Delaware' 'Alabama, Montana'
 'Alabama, District of Columbia' 'Arizona' 'Georgia, Washington' 'Vermont'
 'Alabama' 'Mississippi' 'Oklahoma' 'Massachusetts, Rhode Island'
 'South Dakota' 'Arizona, Utah' 'Massachusetts, Pennsylvania' 'Alaska'
 'Montana' 'Massachusetts, New Hampshire' 'New York, Texas'
 'Utah, Vermont' 'North Dakota' 'Georgia, Massachusetts' 'Maine'
 'Louisiana, Washington' 'New Jersey, New York' 'California, Oregon'
 'District of Columbia, Virginia' 'California, Colorado'
 'California, Maryland' 'Michigan, Texas, Washington']

                                min           mean      max
state
Michigan, Texas, Washington  340000  340000.000000   340000
California, Oregon           200000  200000.000000   200000
California, Colorado         176000  176000.000000   176000
Georgia, Massachusetts       175000  175000.000000   175000
Florida                       28800  157457.232143  2600000

That did the trick! Now let’s narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [ ]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
us_states_df['timestamp'] = pd.to_datetime(us_states_df['timestamp']) #y/m/d h:m:s?
us_states_df.info()

us_states_df.head()
year_df = us_states_df [us_states_df['timestamp'].dt.year.isin([2021,2022,2023])]
year_df.head()
year_df.groupby('state')['salary'].agg(['min', 'mean', 'max']).sort_values(by='mean', ascending=False)
#WHAT DO I DO W PPL WHO WORK IN MULTIPLE STATES?

<class 'pandas.core.frame.DataFrame'>
Index: 3724 entries, 8 to 28058
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   timestamp                    3724 non-null   datetime64[ns]
 1   age                          3724 non-null   object
 2   industry                     3724 non-null   object
 3   title                        3724 non-null   object
 4   title_context                697 non-null    object
 5   salary                       3724 non-null   int64
 6   additional_compensation      2898 non-null   float64
 7   currency                     3724 non-null   object
 8   other_currency               4 non-null      object
 9   salary_context               533 non-null    object
 10  country                      3724 non-null   object
 11  state                        3702 non-null   object
 12  city                         3716 non-null   object
 13  total_yoe                    3724 non-null   object
 14  field_yoe                    3724 non-null   object
 15  highest_education_completed  3698 non-null   object
 16  gender                       3704 non-null   object
 17  race                         3699 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(1), object(15)
memory usage: 552.8+ KB

/tmp/ipykernel_4070/2028106024.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  us_states_df['timestamp'] = pd.to_datetime(us_states_df['timestamp']) #y/m/d h:m:s?

                                  min           mean     max
state
Michigan, Texas, Washington    340000  340000.000000  340000
California, Oregon             200000  200000.000000  200000
California, Colorado           176000  176000.000000  176000
Georgia, Massachusetts         175000  175000.000000  175000
Alabama, District of Columbia  156000  156000.000000  156000
...                               ...            ...     ...
Louisiana                       35360   83269.090909  150000
Massachusetts, Pennsylvania     83000   83000.000000   83000
Arkansas                        55000   81682.300000  144000
California, Maryland            81500   81500.000000   81500
Alabama, Montana                72000   72000.000000   72000

[66 rows x 3 columns]

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you’ve now reached. What do you notice about Delaware and West Virginia?

Let’s back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum―say 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you―like say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* 😜)